greek_words = [
    "βλέπω", "ακούω", "τρώω", "πίνω", "κάνω", "λέω", "πηγαίνω", "έρχομαι", "θέλω", "παίζω",
    "διαβάζω", "γράφω", "ξέρω", "λαμβάνω", "βρίσκω", "δίνω", "περνάω", "μαθαίνω", "νομίζω", "καταλαβαίνω",
    "δουλεύω", "μένω", "ξυπνάω", "κοιμάμαι", "λέγομαι", "αγαπώ", "κοιτάζω", "φεύγω", "αφήνω", "παρακαλώ",
    "αγοράζω", "πουλάω", "φέρνω", "περιμένω", "φοράω", "ανοίγω", "κλείνω", "σκέφτομαι", "χρησιμοποιώ", "πληρώνω",
    "σπάω", "χάνω", "ζητάω", "απαντάω", "γελάω", "κλαίω", "αναπνέω", "ελπίζω", "διδάσκω", "χορεύω",
    "χτίζω", "ψάχνω", "χτυπάω", "φωτογραφίζω", "τραγουδώ", "μιλάω", "ακολουθώ", "φιλάω", "δαγκώνω", "πετώ",
    "φτιάχνω", "τρέχω", "σηκώνω", "πετάω", "διασκεδάζω", "γνωρίζω", "μοιάζω", "ονειρεύομαι", "περπατάω", "καθίζω",
    "σημαίνω", "συμβαίνει", "συμφωνώ", "ενοχλώ", "ενδιαφέρομαι", "επισκέπτομαι", "ανακαλύπτω", "επιθυμώ", "προτείνω", "αποφασίζω",
    "επιτίθεμαι", "υποστηρίζω", "συνεχίζω", "δείχνω", "ανακοινώνω", "περιγράφω", "συμμετέχω", "αποφεύγω", "απολαμβάνω", "προσπαθώ",
    "ρωτάω", "τελειώνω","μετακινώ","σπουδάζω","κλέβω","κερδίζω","χάνομαι","ψηφίζω","κλονίζω","ρίχνω" 
]

greek_words =  [
    "άνθρωπος", "γάτα", "σκύλος", "πόλη", "βιβλίο", "οικία", "αυτοκίνητο", "δέντρο", "ποταμός", "θάλασσα",
    "ηλιος", "φεγγάρι", "αστέρι", "νησί", "ορος", "λίμνη", "πουλί", "ίππος", "ποδήλατο", "παπούτσι",
    "τσάντα", "τραπέζι", "καρέκλα", "πεντάγωνο", "πόρτα", "παράθυρο", "κρεβάτι", "κηπος", "φωτιά", "νερό",
    "αερας", "χώμα", "φως", "μουσική", "ταινία", "πλοίο", "τραίνο", "αεροπλάνο", "οδός", "πλατεία",
    "κατάστημα", "σχολείο", "νοσοκομείο", "εκκλησία", "πάρκο", "παιχνίδι", "υπολογιστής", "τηλεόραση", "τηλέφωνο", "ρολόι",
    "μάτι", "αυτί", "χέρι", "πόδι", "κεφάλι", "στόμα", "μύτη", "δάχτυλο", "καρδιά", "μαλλιά",
    "φωτογραφία", "τοίχος", "κλειδί", "βουνό", "λιβάδι", "ζώο", "φυτό", "φρούτο", "λουλούδι", "σπίτι",
    "παραλία", "γραφείο", "στυλό", "χαρτί", "καπέλο", "φουστανι", "παντελόνι", "μπλούζα", "κολιέ", "καρφίτσα",
    "ραδιόφωνο", "πιάνο", "κιθάρα", "τρομπέτα", "ντραμς", "τυρί", "κρέας", "ψάρι", "λαχανικό", "σαλάτα",
    "μέλισσα", "πεταλούδα", "μουσείο", "θέατρο", "συναυλία", "εισιτήριο", "σταθμός", "καφετέρια", "εφημερίδα", "μαγαζί"
]

greek_words =   [
    "καλός", "μεγάλος", "μικρός", "όμορφος", "άσχημος", "νέος", "παλιός", "σωστός", "λάθος", "γρήγορος",
    "αργός", "δυνατός", "αδύνατος", "έξυπνος", "χαζός", "ζεστός", "κρύος", "καθαρός", "βρώμικος", "ψηλός",
    "χαμηλός", "βαθύς", "ρηχός", "σκληρός", "μαλακός", "ευχάριστος", "δυσάρεστος", "ελαφρύς", "βαρύς", "σκοτεινός",
    "φωτεινός", "κοντός", "μακρύς", "στενός", "φαρδύς", "πλούσιος", "φτωχός", "γεμάτος", "άδειος", "σκέτος",
    "πικάντικος", "γλυκός", "αλμυρός", "οξύς", "βαρετός", "ενδιαφέρων", "πεινασμένος", "κορεσμένος", "κουρασμένος", "ξεκούραστος",
    "υγρός", "ξηρός", "δημοφιλής", "άγνωστος", "φρέσκος", "σάπιος", "νωπός", "στεγνός", "ακριβός", "φθηνός",
    "κενός", "γεμάτος", "βροχερός", "ηλιόλουστος", "υποχρεωτικός", "προαιρετικός", "κομψός", "ατίθασος", "χοντρός", "λεπτός",
    "μοναχικός", "κοινωνικός", "κακός", "καλόκαρδος", "απλός", "πολύπλοκος", "ήσυχος", "θορυβώδης", "σαφής", "ασαφής",
    "ενεργητικός", "παθητικός", "ανοιχτός", "κλειστός", "αντιφατικός", "αρμονικός", "δραστήριος", "χαλαρός", "σταθερός", "ασταθής",
    "ακατέργαστος", "επεξεργασμένος", "διακριτικός", "φανερός", "μετριοπαθής", "έντονος", "υπερήφανος", "ταπεινός", "συντηρητικός", "προοδευτικός"
]
