import re

class GreekStemmer:
    def stem(self,word):

        word = word.upper()

        ###--- Step 1 ---###
        if word.endswith('ΦΑΓΙΑ') or word.endswith('ΦΑΓΙΟΥ') or word.endswith('ΦΑΓΙΩΝ'):
            word = re.sub('(ΦΑΓΙΑ|ΦΑΓΙΟΥ|ΦΑΓΙΩΝ)$', 'ΦΑ', word)   
        if word.endswith('ΣΚΑΓΙΑ') or word.endswith('ΣΚΑΓΙΟΥ') or word.endswith('ΣΚΑΓΙΩΝ'):
            word = re.sub('(ΣΚΑΓΙΑ|ΣΚΑΓΙΟΥ|ΣΚΑΓΙΩΝ)$', 'ΣΚΑ', word)   
        if word.endswith('ΟΛΟΓΙΑ') or word.endswith('ΟΛΟΓΙΟΥ') or word.endswith('ΟΛΟΓΙΩΝ'):
            word = re.sub('(ΟΛΟΓΙΑ|ΟΛΟΓΙΟΥ|ΟΛΟΓΙΩΝ)$', 'ΟΛΟ', word)   
        if word.endswith('ΣΟΓΙΑ') or word.endswith('ΣΟΓΙΟΥ') or word.endswith('ΣΟΓΙΩΝ'):
            word = re.sub('(ΣΟΓΙΑ|ΣΟΓΙΟΥ|ΣΟΓΙΩΝ)$', 'ΣΟ', word)   
        if word.endswith('ΤΑΤΟΓΙΑ') or word.endswith('ΤΑΤΟΓΙΟΥ') or word.endswith('ΤΑΤΟΓΙΩΝ'):
            word = re.sub('(ΤΑΤΟΓΙΑ|ΤΑΤΟΓΙΟΥ|ΤΑΤΟΓΙΩΝ)$', 'ΤΑΤΟ', word)   
        if word.endswith('ΚΡΕΑΣ') or word.endswith('ΚΡΕΑΤΟΣ') or word.endswith('ΚΡΕΑΤΑ') or word.endswith('ΚΡΕΑΤΩΝ'):
            word = re.sub('(ΚΡΕΑΣ|ΚΡΕΑΤΟΣ|ΚΡΕΑΤΑ|ΚΡΕΑΤΩΝ)$', 'ΚΡΕ', word)   
        if word.endswith('ΠΕΡΑΣ') or word.endswith('ΠΕΡΑΤΟΣ') or word.endswith('ΠΕΡΑΤΗ') or word.endswith('ΠΕΡΑΤΑ') or word.endswith('ΠΕΡΑΤΩΝ'):
            word = re.sub('(ΠΕΡΑΣ|ΠΕΡΑΤΟΣ|ΠΕΡΑΤΗ|ΠΕΡΑΤΑ|ΠΕΡΑΤΩΝ)$', 'ΠΕΡ', word)   
        if word.endswith('ΤΕΡΑΣ') or word.endswith('ΤΕΡΑΤΟΣ') or word.endswith('ΤΕΡΑΤΑ') or word.endswith('ΤΕΡΑΤΩΝ'):
            word = re.sub('(ΤΕΡΑΣ|ΤΕΡΑΤΟΣ|ΤΕΡΑΤΑ|ΤΕΡΑΤΩΝ)$', 'ΤΕΡ', word)   
        if word.endswith('ΦΩΣ') or word.endswith('ΦΩΤΟΣ') or word.endswith('ΦΩΤΑ') or word.endswith('ΦΩΤΩΝ'):
            word = re.sub('(ΦΩΣ|ΦΩΤΟΣ|ΦΩΤΑ|ΦΩΤΩΝ)$', 'ΦΩ', word)   
        if word.endswith('ΚΑΘΕΣΤΩΣ') or word.endswith('ΚΑΘΕΣΤΩΤΟΣ') or word.endswith('ΚΑΘΕΣΤΩΤΑ') or word.endswith('ΚΑΘΕΣΤΩΤΩΝ'):
            word = re.sub('(ΚΑΘΕΣΤΩΣ|ΚΑΘΕΣΤΩΤΟΣ|ΚΑΘΕΣΤΩΤΑ|ΚΑΘΕΣΤΩΤΩΝ)$', 'ΚΑΘΕΣΤ', word)   
        if word.endswith('ΓΕΓΟΝΟΣ') or word.endswith('ΓΕΓΟΝΟΤΟΣ') or word.endswith('ΓΕΓΟΝΟΤΑ') or word.endswith('ΓΕΓΟΝΟΤΩΝ'):
            word = re.sub('(ΓΕΓΟΝΟΣ|ΓΕΓΟΝΟΤΟΣ|ΓΕΓΟΝΟΤΑ|ΓΕΓΟΝΟΤΩΝ)$', 'ΓΕΓΟΝ', word) 
       
        ###--- Step S1 ---###
        if word.endswith(('ΙΖΑ','ΙΖΕΣ','ΙΖΕ','ΙΖΑΜΕ','ΙΖΑΤΕ','ΙΖΑΝ','ΙΖΑΝΕ','ΙΖΩ','ΙΖΕΙΣ','ΙΖΕΙ','ΙΖΟΥΜΕ','ΙΖΕΤΕ','ΙΖΟΥΝ','ΙΖΟΥΝΕ')):
            pattern = r'ΙΖ(Α|ΕΣ|Ε|ΑΜΕ|ΑΤΕ|ΑΝ|ΑΝΕ|Ω|ΕΙΣ|ΕΙ|ΟΥΜΕ|ΕΤΕ|ΟΥΝ|ΟΥΝΕ)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('ΑΝΑΜΠΑ','ΕΜΠΑ','ΕΠΑ','ΞΑΝΑΠΑ','ΠΑ','ΠΕΡΙΠΑ','ΑΘΡΟ','ΣΥΝΑΘΡΟ','ΔΑΝΕ')):
                word = word + 'Ι'
            elif word.endswith(('ΜΑΡΚ','ΚΟΡΝ','ΑΜΠΑΡ','ΑΡΡ','ΒΑΘΥΡΙ','ΒΑΡΚ','Β','ΒΟΛΒΟΡ','ΓΚΡ',
                                'ΓΛΥΚΟΡ','ΓΛΥΚΥΡ','ΙΜΠ','Λ','ΛΟΥ','ΜΑΡ','Μ','ΠΡ','ΜΠΡ','ΠΟΛΥΡ','Π','Ρ','ΠΙΠΕΡΟΡ')):
                word = word + 'ΙΖ'
        
        ###--- Step S2 ---###
        if word.endswith(('ΩΘΗΚΑ','ΩΘΗΚΕΣ','ΩΘΗΚΕ','ΩΘΗΚΑΜΕ','ΩΘΗΚΑΤΕ','ΩΘΗΚΑΝ','ΩΘΗΚΑΝΕ')):
            pattern = r'ΩΘΗΚ(Α|ΕΣ|Ε|ΑΜΕ|ΑΤΕ|ΑΝ|ΑΝΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΛ','ΒΙ','ΕΝ','ΥΨ','ΛΙ','ΖΩ','Σ','Χ'):
                word = word + 'ΩΝ'

        ###--- Step S3 ---###
        if word.endswith(('ΙΣΑ','ΙΣΕΣ','ΙΣΕ','ΙΣΑΜΕ','ΙΣΑΤΕ','ΙΣΑΝ','ΙΣΑΝΕ')):
            if word == 'ΙΣΑ':
                word = 'ΙΣ'
                return word
            pattern = r'ΙΣ(Α|ΕΣ|Ε|ΑΜΕ|ΑΤΕ|ΑΝ|ΑΝΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΝΑΜΠΑ','ΑΘΡΟ','ΕΜΠΑ','ΕΣΕ','ΕΣΩΚΛΕ','ΕΠΑ','ΞΑΝΑΠΑ','ΕΠΕ','ΠΕΡΙΠΑ','ΣΥΝΑΘΡΟ','ΔΑΝΕ','ΚΛΕ',
                        'ΧΑΡΤΟΠΑ','ΕΞΑΡΧΑ','ΜΕΤΕΠΕ','ΑΠΟΚΛΕ','ΑΠΕΚΛΕ','ΕΚΛΕ','ΠΕ'):
                word = word + 'Ι'
            elif word in ('ΑΝ','ΑΦ','ΓΕ','ΓΙΓΑΝΤΟΑΦ','ΓΚΕ','ΔΗΜΟΚΡΑΤ','ΚΟΜ','ΓΚ','Μ','Π','ΠΟΥΚΑΜ','ΟΛΟ','ΛΑΡ'):
                word = word + 'ΙΣ'

        ###--- Step S4 ---###
        if word.endswith(('ΙΣΩ','ΙΣΕΙΣ','ΙΣΕΙ','ΙΣΟΥΜΕ','ΙΣΕΤΕ','ΙΣΟΥΝ','ΙΣΟΥΝΕ')):
            pattern = r'ΙΣ(Ω|ΕΙΣ|ΕΙ|ΟΥΜΕ|ΕΤΕ|ΟΥΝ|ΟΥΝΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΝΑΜΠΑ','ΑΘΡΟ','ΕΜΠΑ','ΕΣΕ','ΕΣΩΚΛΕ','ΕΠΑ','ΞΑΝΑΠΑ','ΕΠΕ','ΠΕΡΙΠΑ','ΣΥΝΑΘΡΟ','ΔΑΝΕ','ΚΛΕ',
                        'ΧΑΡΤΟΠΑ','ΕΞΑΡΧΑ','ΜΕΤΕΠΕ','ΑΠΟΚΛΕ','ΑΠΕΚΛΕ','ΕΚΛΕ','ΠΕ'):
                word = word + 'Ι'

        ###--- Step S5 ---###
        if word.endswith(('ΙΣΤΟΣ','ΙΣΤΟΥ','ΙΣΤΟ','ΙΣΤΕ','ΙΣΤΟΙ','ΙΣΤΩΝ','ΙΣΤΟΥΣ','ΙΣΤΗ','ΙΣΤΗΣ','ΙΣΤΑ','ΙΣΤΕΣ')):
            pattern = r'ΙΣΤ(ΟΣ|ΟΥ|Ο|Ε|ΟΙ|ΩΝ|ΟΥΣ|Η|ΗΣ|Α|ΕΣ)$'
            word = re.sub(pattern, '', word)
            if word in ('Μ','Π','ΑΠ','ΑΡ','ΗΔ','ΚΤ','ΣΚ','ΣΧ','ΥΨ','ΦΑ','ΧΡ','ΧΤ','ΑΚΤ','ΑΟΡ','ΑΣΧ','ΑΤΑ','ΑΧΝ',
                        'ΑΧΤ','ΓΕΜ','ΓΥΡ','ΕΜΠ','ΕΥΠ','ΕΧΘ','ΗΦΑ','ΚΑΘ','ΚΑΚ','ΚΥΛ','ΛΥΓ','ΜΑΚ','ΜΕΓ','ΤΑΧ','ΦΙΛ','ΧΩΡ'):
                word = word + 'ΙΣΤ'
            elif word in ('ΣΥΝΑΘΡΟ','ΔΑΝΕ','ΚΛΕ','ΣΕ','ΕΣΩΚΛΕ','ΑΣΕ','ΠΛΕ'):
                word = word + 'Ι'
       
        ###--- Step S6 ---###
        if word.endswith(('ΙΣΜΟ','ΙΣΜΟΙ','ΙΣΜΟΣ','ΙΣΜΟΥ','ΙΣΜΟΥΣ','ΙΣΜΩΝ')):
            pattern = r'ΙΣΜ(Ο|ΟΙ|ΟΣ|ΟΥ|ΩΝ|ΟΥΣ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΓΝΩΣΤΙΚ','ΑΤΟΜΙΚ','ΓΝΩΣΤΙΚ','ΕΘΝΙΚ','ΕΚΛΕΚΤΙΚ','ΣΚΕΠΤΙΚ','ΤΟΠΙΚ'):
                word = word[:-2]
            elif word in ('ΣΕ','ΜΕΤΑΣΕ','ΜΙΚΡΟΣΕ','ΕΓΚΛΕ','ΑΠΟΚΛΕ'):
                word = word + 'ΙΣΜ'
            elif word in ('ΔΑΝΕ','ΑΝΤΙΔΑΝΕ'):
                word = word + 'Ι' 
            elif word in ('ΑΛΕΞΑΝΔΡΙΝ','ΒΥΖΑΝΤΙΝ','ΘΕΑΤΡΙΝ'):
                word = word[:-2]     
       
        ###--- Step S7 ---###
        if word.endswith(('ΑΡΑΚΙ','ΑΡΑΚΙΑ','ΟΥΔΑΚΙ','ΟΥΔΑΚΙΑ')):
            pattern = r'(ΑΡΑΚΙ|ΑΡΑΚΙΑ|ΟΥΔΑΚΙ|ΟΥΔΑΚΙΑ)$'
            word = re.sub(pattern, '', word)
            if word in ('Χ','Σ'):
                word = word +'ΑΡΑΚΙ'
       
        ###--- Step S8 ---###
        if word.endswith(('ΑΚΙ','ΑΚΙΑ','ΙΤΣΑ','ΙΤΣΑΣ','ΙΤΣΕΣ','ΙΤΣΩΝ','ΑΡΑΚΙ','ΑΡΑΚΙΑ')):
            pattern = r'(ΑΚΙ|ΑΚΙΑ|ΙΤΣΑ|ΙΤΣΑΣ|ΙΤΣΕΣ|ΙΤΣΩΝ|ΑΡΑΚΙ|ΑΡΑΚΙΑ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΝΘΡ','ΒΑΜΒ','ΒΡ','ΚΑΙΜ','ΚΟΝ','ΚΟΡ','ΛΑΒΡ','ΛΟΥΛ','ΜΕΡ','ΜΟΥΣΤ','ΝΑΓΚΑΣ','ΠΛ','Ρ',
                        'ΡΥ','Σ','ΣΚ','ΣΟΚ','ΣΠΑΝ','ΤΖ','ΦΑΡΜ','Χ','ΚΑΠΑΚ','ΑΛΙΣΦ','ΑΜΒΡ','Κ','ΦΥΛ','ΚΑΤΡΑΠ',
                        'ΚΛΙΜ','ΜΑΛ','ΣΛΟΒ','ΣΦ','ΤΣΕΧΟΣΛΟΒ'):
                word = word + 'ΑΚ'
            elif word in ('Β','ΒΑΛ','ΓΙΑΝ','ΓΛ','Ζ','ΗΓΟΥΜΕΝ','ΚΑΡΔ','ΚΟΝ','ΜΑΚΡΥΝ','ΝΥΦ','ΠΑΤΕΡ','Π','ΣΚ','ΤΟΣ','ΤΡΙΠΟΛ'):
                word = word + 'ΙΤΣ'
            elif word.endswith(('ΚΟΡ')):
                word = word + 'ΙΤΣ' 
            
        ###--- Step S9 ---###
        if word.endswith(('ΙΔΙΟ','ΙΔΙΑ','ΙΔΙΩΝ')):
            pattern = r'ΙΔΙ(Ο|Α|ΩΝ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΙΦΝ','ΙΡ','ΟΛΟ','ΨΑΛ'):
                word = word + 'ΙΔ'
            elif word.endswith(('Ε','ΠΑΙΧΝ')):
                word = word + 'ΙΔ' 
       
        ###--- Step S10 ---###
        if word.endswith(('ΙΣΚΟΣ','ΙΣΚΟΥ','ΙΣΚΟ','ΙΣΚΕ')):
            pattern = r'ΙΣΚ(ΟΣ|ΟΥ|Ο|Ε)$'
            word = re.sub(pattern, '', word)
            if word in ('Δ','ΙΒ','ΜΗΝ','Ρ','ΦΡΑΓΚ','ΛΥΚ','ΟΒΕΛ'):
                word = word + 'ΙΣΚ'

        ###--- Step 2a ---###
        if word.endswith(('ΑΔΕΣ','ΑΔΩΝ')):
            pattern = r'ΑΔ(ΕΣ|ΩΝ)$'
            word = re.sub(pattern, '', word)
            if not word.endswith(('ΟΚ','ΜΑΜ','ΜΑΝ','ΜΠΑΜΠ','ΠΑΤΕΡ','ΓΙΑΓΙ','ΝΤΑΝΤ','ΚΥΡ','ΘΕΙ','ΠΕΘΕΡ')):
                word = word + 'ΑΔ'

        ###--- Step 2b ---###
        if word.endswith(('ΕΔΕΣ','ΕΔΩΝ')):
            pattern = r'ΕΔ(ΕΣ|ΩΝ)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('ΟΠ','ΙΠ','ΕΜΠ','ΥΠ','ΓΗΠ','ΔΑΠ','ΚΡΑΣΠ','ΜΙΛ')):
                word = word + 'ΕΔ'

        ###--- Step 2c ---###
        if word.endswith(('ΟΥΔΕΣ','ΟΥΔΩΝ')):
            pattern = r'ΟΥΔ(ΕΣ|ΩΝ)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('ΑΡΚ','ΚΑΛΙΑΚ','ΠΕΤΑΛ','ΛΙΧ','ΠΛΕΧ','ΣΚ','Σ','ΦΛ','ΦΡ','ΒΕΛ','ΛΟΥΛ','ΧΝ','ΣΠ','ΤΡΑ','ΦΕ')):
                word = word + 'ΟΥΔ'
       
        ###--- Step 2d ---###
        if word.endswith(('ΕΩΣ','ΕΩΝ')):
            pattern = r'ΕΩ(Σ|Ν)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('ΑΡΚ','ΚΑΛΙΑΚ','ΠΕΤΑΛ','ΛΙΧ','ΠΛΕΞ','ΣΚ','Σ','ΦΛ','ΦΡ','ΒΕΛ','ΛΟΥΛ','ΧΝ','ΣΠ','ΤΡΑΓ','ΦΕ')):
                word = word + 'Ε'
       
        ###--- Step 3 ---###
        if word.endswith(('ΙΑ','ΙΟΥ','ΙΩΝ')):
            pattern = r'Ι(Α|ΟΥ|ΩΝ)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('Α','Ε','Η','Ι','Ο','Υ','Ω')):
                word = word + 'I'

        ###--- Step 4 ---###
        if word.endswith(('ΙΚΑ','ΙΚΟ','ΙΚΟΥ','ΙΚΩΝ')):
            pattern = r'ΙΚ(Α|Ο|ΟΥ|ΩΝ)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('Α','Ε','Η','Ι','Ο','Υ','Ω')) or word in ('ΑΛ','ΑΔ','ΕΝΔ','ΑΜΑΝ','ΑΜΜΟΧΑΛ','ΗΘ',
                                                                        'ΑΝΗΘ','ΑΝΤΙΔ','ΦΥΣ','ΒΡΩΜ','ΓΕΡ','ΕΞΩΔ',
                                                                        'ΚΑΛΠ','ΚΑΛΛΙΝ','ΚΑΤΑΔ','ΜΟΥΛ','ΜΠΑΝ',
                                                                        'ΜΠΑΓΙΑΤ','ΜΠΟΛ','ΜΠΟΣ','ΝΙΤ','ΞΙΚ','ΣΥΝΟΜΗΛ',
                                                                        'ΠΕΤΣ','ΠΙΤΣ','ΠΙΚΑΝΤ','ΠΛΙΑΤΣ','ΠΟΣΤΕΛΝ',
                                                                        'ΠΡΩΤΟΔ','ΣΕΡΤ','ΣΥΝΑΔ','ΤΣΑΜ','ΥΠΟΔ',
                                                                        'ΦΙΛΟΝ','ΦΥΛΟΔ','ΧΑΣ'):
                word = word + 'IΚ'

        ###--- Step 5a ---###
        if word == 'ΑΓΑΜΕ':
            word = 'ΑΓΑΜ'
            return word
        elif word.endswith(('ΑΓΑΜΕ','ΗΣΑΜΕ','ΟΥΣΑΜΕ','ΗΚΑΜΕ','ΗΘΗΚΑΜΕ')):
            pattern = r'(ΑΓΑΜΕ|ΗΣΑΜΕ|ΟΥΣΑΜΕ|ΗΚΑΜΕ|ΗΘΗΚΑΜΕ)$'
            word = re.sub(pattern, '', word)
        elif word.endswith(('ΑΜΕ')):
            pattern = r'(ΑΜΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΝΑΠΝ','ΑΠΟΘ','ΑΠΟΚ','ΑΠΟΣΤ','ΒΟΥΒ','ΞΕΘ','ΟΥΛ','ΠΕΘ','ΠΙΚΡ','ΠΟΤ','ΣΙΧ','Χ'):
                word = word + 'ΑΜ'
        
        ###--- Step 5b ---###
        if word.endswith(('ΑΓΑΝΕ','ΗΣΑΝΕ','ΟΥΣΑΝΕ','ΙΟΝΤΑΝΕ','ΙΟΤΑΝΕ','ΙΟΥΝΤΑΝΕ','ΟΝΤΑΝΕ','ΟΤΑΝΕ','ΟΥΝΤΑΝΕ','ΗΚΑΝΕ','ΗΘΗΚΑΝΕ')):
            pattern = r'(ΑΓΑΝΕ|ΗΣΑΝΕ|ΟΥΣΑΝΕ|ΙΟΝΤΑΝΕ|ΙΟΤΑΝΕ|ΙΟΥΝΤΑΝΕ|ΟΝΤΑΝΕ|ΟΤΑΝΕ|ΟΥΝΤΑΝΕ|ΗΚΑΝΕ|ΗΘΗΚΑΝΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΤΡ','ΤΣ'):
                word = word + 'ΑΓΑΝ'
            elif word.endswith(('Α','Ε','Η','Ι','Ο','Ω')) or word in ('ΒΕΤΕΡ','ΒΟΥΛΚ','ΒΡΑΧΜ','Γ','ΔΡΑΔΟΥΜ','Θ','ΚΑΛΠΟΥΖ','ΚΑΣΤΕΛ','ΚΟΡΜΟΡ','ΛΑΟΠΛ','ΜΩΑΜΕΘ','Μ','ΜΟΥΣΟΥΛΜ',
                                                                      'Ν','ΟΥΛ','Π','ΠΕΛΕΚ','ΠΛ','ΠΟΛΙΣ','ΠΟΡΤΟΛ','ΣΑΡΑΚΑΤΣ','ΣΟΥΛΤ','ΤΣΑΡΛΑΤ','ΟΡΦ','ΤΣΙΓΓ','ΤΣΟΠ','ΦΩΤΟΣΤΕΦ',
                                                                      'Χ','ΨΥΧΟΠΛ','ΑΓ','ΟΡΦ','ΓΑΛ','ΓΕΡ','ΔΕΚ','ΔΙΠΛ','ΑΜΕΡΙΚΑΝ','ΟΥΡ','ΠΙΘ','ΠΟΥΡΙΤ','Σ','ΖΩΝΤ','ΙΚ','ΚΑΣΤ',
                                                                      'ΚΟΠ','ΛΙΧ','ΛΟΥΘΗΡ','ΜΑΙΝΤ','ΜΕΛ','ΣΙΓ','ΣΠ','ΣΤΕΓ','ΤΡΑΓ','ΤΣΑΓ','Φ','ΕΡ','ΑΔΑΠ','ΑΘΙΓΓ','ΑΜΗΧ','ΑΝΙΚ',
                                                                      'ΑΝΟΡΓ','ΑΠΗΓ','ΑΠΙΘ','ΑΤΣΙΓΓ','ΒΑΣ','ΒΑΣΚ','ΒΑΘΥΓΑΛ','ΒΙΟΜΗΧ','ΒΡΑΧΥΚ','ΔΙΑΤ','ΔΙΑΦ','ΕΝΟΡΓ','ΘΥΣ',
                                                                      'ΚΑΠΝΟΒΙΟΜΗΧ','ΚΑΤΑΓΑΛ','ΚΛΙΒ','ΚΟΙΛΑΡΦ','ΛΙΒ','ΜΕΓΑΛΟΒΙΟΜΗΧ','ΜΙΚΡΟΒΙΟΜΗΧ','ΝΤΑΒ','ΞΗΡΟΚΛΙΒ','ΟΛΙΓΟΔΑΜ',
                                                                      'ΟΛΟΓΑΛ','ΠΕΝΤΑΡΦ','ΠΕΡΗΦ','ΠΕΡΙΤΡ','ΠΛΑΤ','ΠΟΛΥΔΑΠ','ΠΟΛΥΜΗΧ','ΣΤΕΦ','ΤΑΒ','ΤΕΤ','ΥΠΕΡΗΦ','ΥΠΟΚΟΠ',
                                                                      'ΧΑΜΗΛΟΔΑΠ','ΨΗΛΟΤΑΒ'):
                word = word + 'ΑΝ'      

        ###--- Step 5c ---###
        if word.endswith(('ΗΣΕΤΕ')):
            pattern = r'(ΗΣΕΤΕ)$'
            word = re.sub(pattern, '', word)
        elif word.endswith(('ΕΤΕ')):
            pattern = r'(ΕΤΕ)$'
            word = re.sub(pattern, '', word)
            if word.endswith(('Α','Ε','Η','Ι','Ο','Ω')) or word in ('ΑΒΡ','ΒΕΝ','ΕΝΑΡ','ΑΒΡ','ΑΔ','ΑΘ','ΑΝ',
            'ΑΠΛ','ΒΑΡΟΝ','ΝΤΡ','ΣΚ','ΚΟΠ','ΜΠΟΡ','ΝΙΦ','ΠΑΓ','ΠΑΡΑΚΑΛ','ΣΕΡΠ','ΣΚΕΛ','ΣΥΡΦ','ΤΟΚ','Υ','Δ','ΕΜ',
            'ΘΑΡΡ','Θ') or word.endswith(('ΟΔ','ΑΙΡ','ΦΟΡ','ΤΑΘ','ΔΙΑΘ','ΣΧ','ΕΝΔ','ΕΥΡ','ΤΙΘ','ΥΠΕΡΘ','ΡΑΘ','ΕΝΘ',
            'ΡΟΘ','ΣΘ','ΠΥΡ','ΑΙΝ','ΣΥΝΔ','ΣΥΝ','ΣΥΝΘ','ΧΩΡ','ΠΟΝ','ΒΡ','ΚΑΘ','ΕΥΘ','ΕΚΘ','ΝΕΤ','ΡΟΝ','ΑΡΚ',
            'ΒΑΡ','ΒΟΛ','ΩΦΕΛ')):
                word = word + 'ΕΤ'

        ###--- Step 5d ---###
        if word.endswith(('ΟΝΤΑΣ','ΩΝΤΑΣ')):
            pattern = r'(ΟΝΤΑΣ|ΩΝΤΑΣ)$'
            word = re.sub(pattern, '', word)
            if word == 'ΑΡΧ':
                word = word + 'ΟΝΤ'
            elif word == 'ΚΡΕ':
                word = word + 'ΩΝΤ'

        ###--- Step 5e ---###
        if word.endswith(('ΟΜΑΣΤΕ','ΙΟΜΑΣΤΕ')):
            pattern = r'(ΟΜΑΣΤΕ|ΙΟΜΑΣΤΕ)$'
            word = re.sub(pattern, '', word)
            if word == 'ΟΝ':
                word = word + 'ΟΜΑΣΤ'

        ###--- Step 5f ---###
        if word.endswith(('ΙΕΣΤΕ')):
            pattern = r'(ΙΕΣΤΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('Π','ΑΠ','ΣΥΜΠ','ΑΣΥΜΠ','ΑΚΑΤΑΠ','ΑΜΕΤΑΜΦ'):
                word = word + 'ΙΕΣΤ'
        elif word.endswith(('ΕΣΤΕ')):
            pattern = r'(ΕΣΤΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΛ','ΑΡ','ΕΚΤΕΛ','Ζ','Μ','Ξ','ΠΑΡΑΚΑΛ','ΑΡ','ΠΡΟ','ΝΙΣ'):
                word = word + 'ΕΣΤ'

        ###--- Step 5g ---###
        if word.endswith(('ΗΘΗΚΑ','ΗΘΗΚΕΣ','ΗΘΗΚΕ')):
            pattern = r'ΗΘΗΚ(Α|ΕΣ|Ε)$'
            word = re.sub(pattern, '', word)
        elif word.endswith(('ΗΚΑ','ΗΚΕΣ','ΗΚΕ')):
            pattern = r'ΗΚ(Α|ΕΣ|Ε)$'
            word = re.sub(pattern, '', word)
            if word in ('ΔΙΑΘ','Θ','ΠΑΡΑΚΑΤΑΘ','ΠΡΟΣΘ','ΣΥΝΘ') or word.endswith(('ΣΚΩΛ','ΣΚΟΥΛ','ΝΑΡΘ','ΣΦ','ΟΘ','ΠΙΘ')):
                word = word + 'ΗΚ'

        ###--- Step 5h ---###
        if word.endswith(('ΟΥΣΑ','ΟΥΣΕΣ','ΟΥΣΕ')):
            pattern = r'ΟΥΣ(Α|ΕΣ|Ε)$'
            word = re.sub(pattern, '', word)
            if word in ('ΦΑΡΜΑΚ','ΧΑΔ','ΑΓΚ','ΑΝΑΡΡ','ΒΡΟΜ','ΕΚΛΙΠ','ΛΑΜΠΙΔ','ΛΕΧ','Μ','ΠΑΤ','Ρ','Λ','ΜΕΔ',
                        'ΜΕΣΑΖ','ΥΠΟΤΕΙΝ','ΑΜ','ΑΙΘ','ΑΝΗΚ','ΔΕΣΠΟΖ','ΕΝΔΙΑΦΕΡ','ΔΕ','ΔΕΥΤΕΡΕΥ','ΚΑΘΑΡΕΥ',
                        'ΠΛΕ','ΤΣΑ') or word.endswith(('ΠΟΔΑΡ','ΒΛΕΠ','ΠΑΝΤΑΧ','ΦΡΥΔ','ΜΑΝΤΙΛ','ΜΑΛΛ','ΚΥΜΑΤ',
                                                       'ΛΑΧ','ΛΗΓ','ΦΑΓ','ΟΜ','ΠΡΩΤ')):
                word = word + 'ΟΥΣ'

        ###--- Step 5i ---###
        if word.endswith(('ΑΓΑ','ΑΓΕΣ','ΑΓΕ')):
            pattern = r'ΑΓ(Α|ΕΣ|Ε)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΒΑΣΤ','ΠΟΛΥΦ','ΑΔΗΦ','ΠΑΜΦ','Ρ','ΑΣΠ','ΑΦ','ΑΜΑΛ','ΑΜΑΛΛΙ','ΑΝΥΣΤ','ΑΠΕΡ','ΑΣΠΑΡ',
            'ΑΧΑΡ','ΔΕΡΒΕΝ','ΔΡΟΣΟΠ','ΞΕΦ','ΝΕΟΠ','ΝΟΜΟΤ','ΟΛΟΠ','ΟΜΟΤ','ΠΡΟΣΤ','ΠΡΟΣΩΠΟΠ','ΣΥΜΠ','ΣΥΝΤ','Τ',
            'ΥΠΟΤ','ΧΑΡ','ΑΕΙΠ','ΑΙΜΟΣΤ','ΑΝΥΠ','ΑΠΟΤ','ΑΡΤΙΠ','ΔΙΑΤ','ΕΝ','ΕΠΙΤ','ΚΡΟΚΑΛΟΠ','ΣΙΔΗΡΟΠ','Λ',
            'ΝΑΥ','ΟΥΛΑΜ','ΟΥΡ','Π','ΤΡ','Μ') or word.endswith(('ΟΦ','ΠΕΛ','ΧΟΡΤ','ΛΛ','ΣΦ','ΡΠ','ΦΡ','ΠΡ',
            'ΛΟΧ','ΣΜΗΝ')) and word not in('ΨΟΦ','ΝΑΥΛΟΧ') and not word.endswith(('ΚΟΛΛ')):
                word = word + 'ΑΓ'

        ###--- Step 5j ---###
        if word.endswith(('ΗΣΕ','ΗΣΟΥ','ΗΣΑ')):
            pattern = r'ΗΣ(Ε|ΟΥ|Α)$'
            word = re.sub(pattern, '', word)
            if word in ('Ν','ΧΕΡΣΟΝ','ΔΩΔΕΚΑΝ','ΕΡΗΜΟΝ','ΜΕΓΑΛΟΝ','ΕΠΤΑΝ'):
                word = word + 'ΗΣ' 

        ###--- Step 5k ---###
        if word.endswith(('ΗΣΤΕ')):
            pattern = r'(ΗΣΤΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΑΣΒ','ΣΒ','ΑΧΡ','ΧΡ','ΑΠΛ','ΑΕΙΜΝ','ΔΥΣΧΡ','ΕΥΧΡ','ΚΟΙΝΟΧΡ','ΠΑΛΙΜΨ'):
                word = word + 'ΗΣΤ' 

        ###--- Step 5l ---###
        if word.endswith(('ΟΥΝΕ','ΗΣΟΥΝΕ','ΗΘΟΥΝΕ')):
            pattern = r'(ΟΥΝΕ|ΗΣΟΥΝΕ|ΗΘΟΥΝΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('Ν','Ρ','ΣΠΙ','ΣΤΡΑΒΟΜΟΥΤΣ','ΚΑΚΟΜΟΥΤΣ','ΕΞΩΝ'):
                word = word + 'ΟΥΝ' 
        elif word.endswith(('ΟΥΜΕ','ΗΣΟΥΜΕ','ΗΘΟΥΜΕ')):
            pattern = r'(ΟΥΝΕ|ΗΣΟΥΝΕ|ΗΘΟΥΝΕ)$'
            word = re.sub(pattern, '', word)
            if word in ('ΠΑΡΑΣΟΥΣ','Φ','Χ','ΩΡΙΟΠΛ','ΑΖ','ΑΛΛΟΣΟΥΣ','ΑΣΟΥΣ'):
                word = word + 'ΟΥΜ'        

        ###--- Step 6 ---###
        if word.endswith(('ΜΑΤΑ','ΜΑΤΩΝ','ΜΑΤΟΣ')):
            pattern = r'ΜΑΤ(Α|ΩΝ|ΟΣ)$'
            word = re.sub(pattern, '', word)
            word = word + 'ΜΑ'
        elif word.endswith(('Α','ΑΓΑΤΕ','ΑΓΑΝ','ΑΕΙ','ΑΜΑΙ','ΑΝ','ΑΣ','ΑΣΑΙ','ΑΤΑΙ','ΑΩ','Ε','ΕΙ','ΕΙΣ','ΕΙΤΕ',
                            'ΕΣΑΙ','ΕΣ','ΕΤΑΙ','Ι','ΙΕΜΑΙ','ΙΕΜΑΣΤΕ','ΙΕΤΑΙ','ΙΕΣΑΙ','ΙΕΣΑΣΤΕ','ΙΟΜΑΣΤΑΝ',
                            'ΙΟΜΟΥΝ','ΙΟΜΟΥΝΑ','ΙΟΝΤΑΝ','ΙΟΝΤΟΥΣΑΝ','ΙΟΣΑΣΤΑΝ','ΙΟΣΑΣΤΕ','ΙΟΣΟΥΝ','ΙΟΣΟΥΝΑ',
                            'ΙΟΤΑΝ','ΙΟΥΜΑΙ','ΙΟΥΜΑΣΤΕ','ΙΟΥΝΤΑΙ','ΙΟΥΝΤΑΝ','Η','ΗΔΕΣ','ΗΔΩΝ','ΗΘΕΙ','ΗΘΕΙΣ',
                            'ΗΘΕΙΤΑΙ','ΗΘΗΚΑΤΕ','ΗΘΗΚΑΝ','ΗΘΟΥΝ','ΗΘΩ','ΗΚΑΤΕ','ΗΚΑΝ','ΗΣ','ΗΣΑΝ','ΗΣΑΤΕ','ΗΣΕΙ',
                            'ΗΣΕΣ','ΗΣΟΥΝ','ΗΣΩ','Ο','ΟΙ','ΟΜΑΙ','ΟΜΑΣΤΑΝ','ΟΜΟΥΝ','ΟΜΟΥΝΑ','ΟΝΤΑΙ','ΟΝΤΑΝ',
                            'ΟΝΤΟΥΣΑΝ','ΟΣ','ΟΣΑΣΤΑΝ','ΟΣΑΣΤΕ','ΟΣΟΥΝ','ΟΣΟΥΝΑ','ΟΤΑΝ','ΟΥ','ΟΥΜΑΙ','ΟΥΜΑΣΤΕ',
                            'ΟΥΝ','ΟΥΝΤΑΙ','ΟΥΝΤΑΝ','ΟΥΣ','ΟΥΣΑΝ','ΟΥΣΑΤΕ','Υ','ΥΣ','Ω','ΩΝ')):
            pattern = r'(Α|ΑΓΑΤΕ|ΑΓΑΝ|ΑΕΙ|ΑΜΑΙ|ΑΝ|ΑΣ|ΑΣΑΙ|ΑΤΑΙ|ΑΩ|Ε|ΕΙ|ΕΙΣ|ΕΙΤΕ|ΕΣΑΙ|ΕΣ|ΕΤΑΙ|Ι|ΙΕΜΑΙ|ΙΕΜΑΣΤΕ|ΙΕΤΑΙ|ΙΕΣΑΙ|ΙΕΣΑΣΤΕ|ΙΟΜΑΣΤΑΝ|ΙΟΜΟΥΝ|ΙΟΜΟΥΝΑ|ΙΟΝΤΑΝ|ΙΟΝΤΟΥΣΑΝ|ΙΟΣΑΣΤΑΝ|ΙΟΣΑΣΤΕ|ΙΟΣΟΥΝ|ΙΟΣΟΥΝΑ|ΙΟΤΑΝ|ΙΟΥΜΑΙ|ΙΟΥΜΑΣΤΕ|ΙΟΥΝΤΑΙ|ΙΟΥΝΤΑΝ|Η|ΗΔΕΣ|ΗΔΩΝ|ΗΘΕΙ|ΗΘΕΙΣ|ΗΘΕΙΤΑΙ|ΗΘΗΚΑΤΕ|ΗΘΗΚΑΝ|ΗΘΟΥΝ|ΗΘΩ|ΗΚΑΤΕ|ΗΚΑΝ|ΗΣ|ΗΣΑΝ|ΗΣΑΤΕ|ΗΣΕΙ|ΗΣΕΣ|ΗΣΟΥΝ|ΗΣΩ|Ο|ΟΙ|ΟΜΑΙ|ΟΜΑΣΤΑΝ|ΟΜΟΥΝ|ΟΜΟΥΝΑ|ΟΝΤΑΙ|ΟΝΤΑΝ|ΟΝΤΟΥΣΑΝ|ΟΣ|ΟΣΑΣΤΑΝ|ΟΣΑΣΤΕ|ΟΣΟΥΝ|ΟΣΟΥΝΑ|ΟΤΑΝ|ΟΥ|ΟΥΜΑΙ|ΟΥΜΑΣΤΕ|ΟΥΝ|ΟΥΝΤΑΙ|ΟΥΝΤΑΝ|ΟΥΣ|ΟΥΣΑΝ|ΟΥΣΑΤΕ|Υ|ΥΣ|Ω|ΩΝ)$'
            word = re.sub(pattern, '', word)

        ###--- Step 7 ---###
        if word.endswith(('ΕΣΤΕΡ','ΕΣΤΑΤ','ΟΤΕΡ','ΟΤΑΤ','ΥΤΕΡ','ΥΤΑΤ','ΩΤΕΡ','ΩΤΑΤ')):
            pattern = r'(ΕΣΤΕΡ|ΕΣΤΑΤ|ΟΤΕΡ|ΟΤΑΤ|ΥΤΕΡ|ΥΤΑΤ|ΩΤΕΡ|ΩΤΑΤ)$'
            word = re.sub(pattern, '', word)

        word = word.lower()
        # Replace final sigma with regular sigma
        if word.endswith('ς'):
            word = word[:-1] + 'σ'

        return word